# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregateIterator..::..Dispose Method
IFCAggregateIterator Class See Also
---
Releases all resources used by the IFCAggregateIterator
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace